[
    {
        "id": 1,
        "description": "Tekos is a new startup in the form of a website application that will serve as a platform for Telkom University students to find accommodation after leaving the dormitory. Students can enjoy the convenience and assurance of having a place to live after the dormitory.",
        "projectName": "Tekos(Telyu Kos)",
        "buildWith": "React, Tailwind, Redux",
        "year": 2023,
        "githubLink": "https://github.com/Ihsanasfari/tekos-fe-react-github",
        "demoLink": "https://tekos-fe-react-github-demo.vercel.app/",
        "images": [
            "./../images/tekos1.webp",
            "./../images/tekos2.webp",
            "./../images/tekos3.webp"
           
        ]
    },
    {
        "id": 2,
        "description": "CineAnime is an anime website that serves as the ultimate haven for enthusiasts, offering a meticulously curated platform that lists a plethora of popular anime titles. It goes beyond being a mere directory, providing users with an intuitive search feature for detailed anime information, including plot summaries, character backgrounds, and user reviews. What sets CineAnime apart is its immersive trailer-watching experience, allowing users to preview the essence of each anime through high-quality trailers. Seamlessly combining a comprehensive listing, detailed information retrieval, and an enticing preview feature, CineAnime emerges as the go-to destination for anyone eager to explore, discover, and indulge in the captivating world of Japanese animation.",
        "projectName": "CineAnime",
        "buildWith": "NextJs, Tailwind",
        "year": 2023,
        "githubLink": "https://github.com/Ihsanasfari/cineanime",
        "demoLink": "https://cineanime-five.vercel.app/",
        "images": [
            "./../images/cineanime.webp",
            "./../images/cineanime.webp",
            "./../images/cineanime.webp"
           
        ]
      },
    {
        "id": 2,
        "description": "This is affiliate",
        "projectName": "Affiliate",
        "buildWith": "NextJs, Tailwind",
        "year": 2023,
        "githubLink": "https://github.com/sample-project-2",
        "demoLink": "https://demo.sample-project-2.com",
        "images": [
            "./../images/affiliate1.webp",
            "./../images/affiliate2.webp"
        ]
      }
   
    ]